/********************************************************************
******************
实验名称：静态数码管实验
接线说明：
实验现象：下载程序后“数码管模块”最左边数码管显示数字 0
注意事项：
*********************************************************************
******************/
// #include "reg52.h"
#include <reg51.h> 
typedef unsigned int u16; //对系统默认数据类型进行重定义
typedef unsigned char u8;
#define SMG_A_DP_PORT P0 //使用宏定义数码管段码口
//共阴极数码管显示 0~F 的段码数据
u8 gsmg_code[17]={0x3f,0x06,0x5b,0x4f,0x66,0x6d,0x7d,0x07,0x7f,0x6f,0x77,0x7c,0x39,0x5e,0x79,0x71};

void main()
{
    SMG_A_DP_PORT=gsmg_code[0];//将数组第 1 个数据赋值给数码管段选口
    while(1)
    {
    }
}